{"22. What is transfer learning in image classification?": "Using a pre-trained model and fine-tuning it on a new dataset", "16. What is a convolutional neural network (CNN) specialized for?": "Image processing", "43. What is backpropagation in the context of neural networks?": "A method to train neural networks by adjusting weights based on prediction errors", "45. What is the advantage of using a stride greater than 1 in a convolutional layer?": "It reduces the computational complexity of the layer.", "41. What is the basic building block of a neural network?": "A neuron", "32. What are features in the context of image pattern classification?": "Distinctive visual elements that help distinguish patterns", "18. What is pooling in the context of CNNs?": "Aggregating information from a local region of an image", "35. What is the main idea behind prototype-based pattern classification?": "Matching patterns to predefined prototypes representing class examples", "9. What is a prototype in pattern classification?": "A representative example of a pattern class", "14. Which of the following is a characteristic of deep learning neural networks?": "They can automatically learn features from data", "21. What is overfitting in image classification?": "When a model fits noise in the training data and doesn't generalize well", "34. Which term refers to the process of identifying and extracting relevant information from images?": "Feature extraction", "19. What is data augmentation in image classification?": "Generating new images from existing data by applying transformations", "44. How do deep convolutional neural networks (CNNs) differ from traditional neural networks?": "CNNs are deeper and incorporate convolutional and pooling layers specifically designed for image data.", "5. How are pattern classes typically represented in image classification?": "As raw pixel values", "4. What are patterns in the context of image classification?": "Repetitive textures in images", "23. Which layer in a CNN is responsible for reducing spatial dimensions while retaining important information?": "Pooling layer", "40. What is a decision boundary in the context of image classification?": "A boundary that separates different pattern classes", "46. Why is cross-validation important in image classification?": "To assess the performance of a model on unseen data", "17. What is a kernel or filter in a CNN?": "A small matrix used for feature detection", "24. What is the purpose of using multiple convolutional layers in a CNN?": "To learn hierarchical features from images", "38. What is the goal of an optimum statistical classifier in image pattern classification?": "To maximize the accuracy of classification using probabilistic methods", "12. What does a confusion matrix in image classification represent?": "A matrix showing the misclassifications between different pattern classes", "33. How are pattern classes typically defined in image classification?": "By the textures present in patterns", "3. Which term refers to the predefined categories that images are classified into?": "Classes", "29. What is the primary goal of image pattern classification?": "To classify images into predefined categories based on their features", "31. What is the difference between image classification and image segmentation?": "Image classification involves identifying objects in images, while segmentation involves dividing images into regions.", "42. In neural networks, what does the term \"weight\" represent?": "The numerical parameter that adjusts the strength of connections between neurons", "37. In prototype-based pattern classification, what is a prototype?": "A representative example of a pattern class", "36. What is the purpose of pattern normalization in prototype-based classification?": "To bring patterns to a common scale and orientation", "39. What is the role of Bayes' theorem in image classification?": "It provides a way to calculate the probability of class membership given the observed pattern", "47. What is the purpose of regularization in image classification?": "To prevent overfitting by adding a penalty term to the loss function", "25. What is the role of the padding parameter in a convolutional layer?": "It adds extra pixels around the image", "15. What is the primary purpose of the activation function in a neural network?": "To introduce non-linearity into the model", "20. Which technique is used to split a dataset into training, validation, and testing sets?": "Train-test split", "10. What is the goal of optimum statistical classifiers?": "To achieve the highest possible accuracy in classification", "27. In machine learning, what does the term \"hyperparameter\" refer to?": "Parameters that are set before training and affect the learning process", "11. In the context of image classification, what does the term \"Bayes\" refer to?": "Bayes' theorem and probabilistic methods", "49. What is the role of the activation function in a neural network?": "To introduce non-linearity into the model", "28. What is a learning rate in the context of training machine learning models?": "The rate at which a model learns from the training data", "30. Which of the following is NOT a common challenge in image pattern classification?": "Limited availability of computing resources", "13. What is a neural network in image classification?": "A computational model inspired by the human brain", "1. What is image pattern classification?": "Categorizing images into classes based on their features", "8. Which of the following is NOT a step in prototype-based pattern classification?": "Pattern negation", "26. Which image preprocessing technique involves scaling the pixel values to have a zero mean and unit variance?": "Dataset normalization", "2. Which of the following is NOT a common application of image pattern classification?": "Social media posting", "48. What is early stopping in the training of machine learning models?": "Terminating the training process when the model's performance on the validation set stops improving", "50. What is dropout in the context of neural networks?": "A technique to randomly deactivate some neurons during training to prevent overfitting", "6. In pattern classification, what is a class label?": "A unique identifier for a pattern class", "7. What is prototype matching in pattern classification?": "Matching patterns to predefined prototypes for classification"}