{"Which feature descriptor is sensitive to changes in image scale and rotation?": "Scale-Invariant Feature Transform (SIFT)", 
"How does SIFT achieve scale invariance?": "By using scale-space representation", 
"Which feature extraction method is robust to changes in image orientation?": "Scale-Invariant Feature Transform (SIFT)", 
"What is the purpose of histogram of oriented gradients (HOG) in image feature extraction?": "Highlighting object boundaries", 
"How does region feature extraction contribute to object recognition?": "Capturing texture information", "What role do Gabor filters play in image feature extraction?": "Capturing texture information", "In SIFT, how are keypoints selected from the image?": "Maximizing local contrast", "What is a key advantage of using SIFT for image feature extraction?": "Invariance to rotation and scaling", "What is the purpose of boundary feature descriptors?": "Representing characteristics of object boundaries", "What is a disadvantage of using whole-image features?": "Limited representation of object boundaries", "Which of the following is an example of a region feature descriptor?": "Histogram of oriented gradients (HOG)", "How does principal component analysis (PCA) contribute to feature extraction?": "Reducing dimensionality", "What is the primary function of image feature extraction in digital image processing?": "Extracting relevant information for analysis", "Which feature descriptor is often used for achieving scale invariance in image processing?": "Scale-Invariant Feature Transform (SIFT)", "In image feature extraction, what does the term \"whole-image features\" refer to?": "Statistical properties of the entire image", "Principal components are commonly used as feature descriptors to capture:": "Shape information", "What do whole-image features describe in image processing?": "Statistical properties of the entire image", "In image processing, what does the background refer to?": "Unwanted information", "Which of the following is a characteristic of scale-invariant features?": "Insensitivity to changes in image scale", "What is the primary purpose of applying Principal Component Analysis (PCA) in image processing?": "Reducing dimensionality", "How does the Scale-Invariant Feature Transform (SIFT) handle changes in image orientation?": "By using scale-space representation", "Which feature descriptor is commonly used for capturing texture information?": "Gabor filters", "Which of the following is a characteristic of whole-image features?": "Statistical properties of the entire image", "In image feature extraction, what role do principal components play?": "Capturing shape information", "What is the primary advantage of using region feature descriptors over whole-image features?": "Improved representation of object boundaries", "In image processing, what is the purpose of histogram features?": "Describing color distribution", "Which of the following is a commonly used boundary feature descriptor?": "Chain codes", "What is a limitation of using whole-image features for image analysis?": "Limited representation of object boundaries", "How does region feature extraction differ from boundary feature extraction?": "Focus on overall image structure", "In image processing, what does the term \"scale space\" refer to?": "A series of images at different scales", "What role does the Laplacian of Gaussian (LoG) play in edge detection?": "Highlighting object boundaries", "In the context of feature extraction, what is the purpose of Gabor filters?": "Capturing texture information", "Which of the following is a limitation of using boundary feature descriptors?": "Insensitivity to object boundaries", "Which of the following is a drawback of using Gabor filters for feature extraction?": "Sensitivity to image noise", "What does Principal Component Analysis (PCA) aim to achieve in feature extraction?": "Reducing dimensionality", "In the context of image feature extraction, what does SIFT stand for?": "Scale-Invariant Feature Transform", "In the context of boundary preprocessing, what is the purpose of edge detection?": "Highlighting object boundaries", "What is the primary purpose of region feature descriptors?": "Representing characteristics of object boundaries", "What does the term \"scale invariance\" mean in the context of feature extraction?": "Robustness to changes in image orientation and size", "Which of the following is a common technique for boundary preprocessing in image feature extraction?": "Edge detection", "How does the Laplacian of Gaussian (LoG) contribute to image feature extraction?": "Highlighting object boundaries", "Which feature extraction method is suitable for recognizing objects in different scales and orientations?": "Scale-Invariant Feature Transform (SIFT)", "Which of the following is a characteristic of boundary feature descriptors?": "Representation of object boundaries", "What is the primary purpose of image feature extraction in digital image processing?": "Extracting relevant information for analysis", "What is the purpose of boundary feature descriptors in image feature extraction?": "Representing characteristics of object boundaries", "How does the Histogram of Oriented Gradients (HOG) handle variations in object appearance?": "By capturing texture information", "How does the Histogram of Oriented Gradients (HOG) contribute to image feature extraction?": "Capturing shape information", "What is the primary purpose of scale-space representation in image feature extraction?": "Achieving scale invariance", "How does boundary preprocessing contribute to image feature extraction?": "By highlighting object boundaries"}